[
	{
		"title": "CPU Isosurface Ray Tracing of Adaptive Mesh Refinement Data",
		"authors": "Feng Wang, Ingo Wald, Qi Wu, Will Usher and Chris R. Johnson",
		"venue": "IEEE Transactions on Visualization and Computer Graphics",
		"paper_pdf": "assets/papers/Fen-AMR-VIS18.pdf",
		"teaser": "https://i.imgur.com/2rmTeh2.png",
		"thumb": "assets/papers/thumb/tAMR.png",
		"year": 2018,
		"short_title": "AMR",
		"doi": "10.1109/TVCG.2017.2744079",
		"supplemental_video": "https://www.youtube.com/embed/lTNef_kbLKg",
		"presentation_video": "https://www.youtube.com/embed/XzmYdl9rFs0",
		"downloads": [
			{
				"title": "Videos",
				"list": [
					{
						"title": "Analyzing an Expert Session",
						"link": "https://youtu.be/L5tsU8TtgkU"
					},
					{
						"title": "ZED Mixed Reality Prototype",
						"link": "https://youtu.be/t6rPU6hy5tk"
					},
					{
						"title": "VIS17 Fast Forward",
						"link": "https://youtu.be/mZ6YT_y7Kx0"
					}
				]
			}
		],
		"bibtex": "@article{Usher_VRNT_2018,\n
			author={W. Usher and P. Klacansky and F. Federer and P. T. Bremer and A. Knoll and J. Yarch and A. Angelucci and V. Pascucci},\n
			journal={IEEE Transactions on Visualization and Computer Graphics},\n
			title={A {Virtual} {Reality} {Visualization} {Tool} for {Neuron} {Tracing}},\n
			year={2018},\n
			volume={24},\n
			number={1},\n
			pages={994-1003},\n
			doi={10.1109/TVCG.2017.2744079},\n
			ISSN={1077-2626},\n
			month={Jan},\n}",
		"abstract": "Adaptive mesh refinement (AMR) is a key technology for large-scale simulations that allows for adaptively changing the simulation mesh resolution, resulting in significant computational and storage savings. However, visualizing such AMR data poses a significant challenge due to the difficulties introduced by the hierarchical representation when reconstructing continuous field values. In this paper, we detail a comprehensive solution for interactive isosurface rendering of block-structured AMR data. We contribute a novel reconstruction strategy—the octant method—which is continuous, adaptive and simple to implement. Furthermore, we present a generally applicable hybrid implicit isosurface ray-tracing method, which provides better rendering quality and performance than the built-in sampling-based approach in OSPRay. Finally, we integrate our octant method and hybrid isosurface geometry into OSPRay as a module, providing the ability to create high-quality interactive visualizations combining volume and isosurface representations of BS-AMR data. We evaluate the rendering performance, memory consumption and quality of our method on two gigascale block-structured AMR datasets",
		"teaser_caption": "A screenshot of our VR neuron tracing tool using the isosurface rendering mode. The dark gray floor represents the extent of the tracked space. Users can orient themselves in the dataset via the minimap (right), which shows the world extent in blue, the current focus region in orange, and the previously traced neuronal structures. The focus region is displayed in the center of the space. The 3D interaction and visualization provides an intuitive environment for exploring the data and a natural interface for neuron tracing, resulting in faster, high-quality traces with less fatigue reported by users compared to existing 2D tools."
	},
	{
		"title": "VisIt-OSPRay: Toward an Exascale Volume Visualization System",
		"authors": "Qi Wu, Will Usher, Steve Petruzza, Sidharth Kumar, Feng Wang,
			Ingo Wald, Valerio Pascucci, and Charles D. Hansen",
		"venue": "Eurographics Symposium on Parallel Graphics and Visualization",
		"paper_pdf": "assets/papers/visit-ospray-egpgv18.pdf",
		"teaser": "https://i.imgur.com/JgAOmst.png",
		"thumb": "assets/papers/thumb/tVisItOSPRay.jpg",
		"year": 2018,
		"short_title": "visit-ospray",
		"doi": "10.2312/pgv.20181091",
		"bibtex": "@inproceedings{Wu_VisItOSPRay_2018,\n
			booktitle = {Eurographics Symposium on Parallel Graphics and Visualization},\n
			editor = {Hank Childs and Fernando Cucchietti},\n
			title = {{VisIt-OSPRay: Toward an Exascale Volume Visualization System}},\n
			author = {Wu, Qi and Usher, Will and Petruzza, Steve and Kumar, Sidharth and Wang, Feng and Wald, Ingo and Pascucci, Valerio and Hansen, Charles D.},\n
			year = {2018},\n
			publisher = {The Eurographics Association},\n
			ISSN = {1727-348X},\n
			ISBN = {978-3-03868-054-3},\n
			DOI = {10.2312/pgv.20181091}\n
		}",
		"abstract": "Large-scale simulations can easily produce data in excess of what can be
		efficiently visualized using production visualization software, making it
		challenging for scientists to gain insights from the results of these 
		simulations.
		This trend is expected to grow with exascale. To meet this challenge,
		and run on the highly parallel hardware being deployed on HPC system,
		rendering systems in production visualization software must be redesigned
		to perform well at these new scales and levels of parallelism.
		In this work, we present VisIt-OSPRay, a high-performance,
		scalable, hybrid-parallel rendering system in VisIt, using OSPRay and IceT, 
		coupled with PIDX for scalable I/O. 
		We examine the scalability and memory efficiency of this system and 
		investigate further areas for improvement to prepare VisIt for 
		upcoming exascale workloads.",
		"teaser_caption": "High-quality interactive volume visualization using VisIt-OSPRay:
		<b>a)</b> volume rendering of O<sub>2</sub> concentration inside a combustion chamber,
		data courtesy of the <a href=\"http://ccmsc.sci.utah.edu/\">University of Utah CCMSC</a>;
		<b>b)</b> volume rendering of the Richtmyer-Meshkov Instability;
		<b>c)</b> visualization of a supernova simulation;
		<b>d)</b> visualization of the aneurysm dataset using volume rendering and streamlines;
		<b>e)</b> scalable volume rendering of the 966GB DNS data on 64 Stampede2 Intel Xeon Phi
		Knight's Landing nodes."
	},
	{
		"title": "Association Rules-Based Multivariate Analysis and Visualization of Spatiotemporal Climate Data",
		"authors": "Feng Wang, Wenwen Li, Sizhe Wang and Chris R. Johnson",
		"venue": "International Journal of Geo-Information",
		"paper_pdf": "assets/papers/ijgi-associationRules.pdf",
		"thumb": "assets/papers/thumb/tAssociationRules.png",
		"year": 2018,
		"short_title": "associationRules18",
		"doi": "10.3390/ijgi7070266",
		"downloads": [
			{
				"title": "Videos",
				"list": [
					{
						"title": "Uintah UASC Coal Boiler Visualization",
						"link": "https://youtu.be/vpJtHTzArq4"
					}
				]
			}
		],
		"bibtex": "@article{Wang_2018,\n
			title = {{Association} {Rules-Based} {Multivariate} {Analysis} and {Visualization} of {Spatiotemporal} {Climate} Data},\n
			volume = {7},\n
		    journal = {{ISPRS} International Journal of Geo-Information}},\n
			publisher = {{MDPI} {AG}},\n
			author = {Feng Wang and Wenwen Li and Sizhe Wang and Chris Johnson},\n
			url = {https://doi.org/10.3390%2Fijgi7070266},\n
			year = {2018},\n
			month = {jul},\n
			number = {7},\n
			doi = {10.3390/ijgi7070266},\n
			pages = {266},\n}",
			"abstract": "Understandingatmosphericphenomenainvolvesanalysisoflarge-scalespatiotemporal multivariate data. The complexity and heterogeneity of such data pose a significant challenge in discovering and understanding the association between multiple climate variables. To tackle this challenge, we present an interactive heuristic visualization system that supports climate scientists and the public in their exploration and analysis of atmospheric phenomena of interest. Three techniques are introduced: (1) web-based spatiotemporal climate data visualization; (2) multiview and multivariate scientific data analysis; and (3) data mining-enabled visual analytics. The Arctic System Reanalysis (ASR) data are used to demonstrate and validate the effectiveness and usefulness of our method through a case study of “The Great Arctic Cyclone of 2012”. The results show that different variables have strong associations near the polar cyclone area. This work also provides techniques for identifying multivariate correlation and for better understanding the driving factors of climate phenomena."
	},
	{
		"title": "Web-Scale Multidimensional Visualization of Big Spatial Data to Support Earth Sciences—A Case Study with Visualizing Climate Simulation Data",
		"authors": "Sizhe Wang, Wenwen Li and Feng Wang",
		"venue": "Informatics",
		"paper_pdf": "assets/papers/WSMV.pdf",
		"thumb": "assets/papers/thumb/tWSMV.png",
		"short_title": "WSMV",
		"doi": "10.3390/informatics4030017",
		"year": 2017,
		"bibtex": "@article{Wang_2017,\n
			doi = {10.3390/informatics4030017},\n
			url = {https://doi.org/10.3390%2Finformatics4030017},\n
			year = 2017,\n
			month = {jun},\n
			publisher = {{MDPI} {AG}},\n
			volume = {4},\n
			number = {3},\n
			pages = {17},\n
			author = {Sizhe Wang and Wenwen Li and Feng Wang},\n
			title = {Web-Scale Multidimensional Visualization of Big Spatial Data to Support Earth Sciences{\textemdash}A Case Study with Visualizing Climate Simulation Data},\n
			journal = {Informatics},\n}",
			"abstract": "The world is undergoing rapid changes in its climate, environment, and ecosystems due to increasing population growth, urbanization, and industrialization. Numerical simulation is becoming an important vehicle to enhance the understanding of these changes and their impacts, with regional and global simulation models producing vast amounts of data. Comprehending these multidimensional data and fostering collaborative scientific discovery requires the development of new visualization techniques. In this paper, we present a cyberinfrastructure solution—PolarGlobe—that enables comprehensive analysis and collaboration. PolarGlobe is implemented upon an emerging web graphics library, WebGL, and an open source virtual globe system Cesium, which has the ability to map spatial data onto a virtual Earth. We have also integrated volume rendering techniques, value and spatial filters, and vertical profile visualization to improve rendered images and support a comprehensive exploration of multi-dimensional spatial data. In this study, the climate simulation dataset produced by the extended polar version of the well-known Weather Research and Forecasting Model (WRF) is used to test the proposed techniques. PolarGlobe is also easily extendable to enable data visualization for other Earth Science domains, such as oceanography, weather, or geology."
	},
	{
		"title": "Polar Cyclone Identification from 4D Climate Data in a Knowledge-Driven Visualization System",
		"authors": "Feng Wang, Wenwen Li and Sizhe Wang",
		"venue": "climate",
		"paper_pdf": "assets/papers/PolarCyclone.pdf",
		"thumb": "assets/papers/thumb/tPolarCyclone.png",
		"year": 2016,
		"short_title": "polarCyclone",
		"doi": "10.3390/cli4030043",
		"bibtex": "@article{Wang_2016,\n
			doi = {10.3390/cli4030043},\n
			url = {https://doi.org/10.3390%2Fcli4030043},\n
			year = 2016,\n
			month = {sep},\n
			publisher = {{MDPI} {AG}},\n
			volume = {4},\n
			number = {3},\n
			pages = {43},\n
			author = {Feng Wang and Wenwen Li and Sizhe Wang},\n
			title = {Polar Cyclone Identification from 4D Climate Data in a Knowledge-Driven Visualization System},\n
			journal = {Climate},\n}",
			"abstract": "Arctic cyclone activity has a significant association with Arctic warming and Arctic ice decline. Cyclones in the North Pole are more complex and less developed than those in tropical regions. Identifying polar cyclones proves to be a task of greater complexity. To tackle this challenge, a new method which utilizes pressure level data and velocity field is proposed to improve the identification accuracy. In addition, the dynamic, simulative cyclone visualized with a 4D (four-dimensional) wind field further validated the identification result. A knowledge-driven system is eventually constructed for visualizing and analyzing an atmospheric phenomenon (cyclone) in the North Pole. The cyclone is simulated with WebGL on in a web environment using particle tracing. To achieve interactive frame rates, the graphics processing unit (GPU) is used to accelerate the process of particle advection. It is concluded with the experimental results that: (1) the cyclone identification accuracy of the proposed method is 95.6% when compared with the NCEP/NCAR (National Centers for Environmental Prediction/National Center for Atmospheric Research) reanalysis data; (2) the integrated knowledge-driven visualization system allows for streaming and rendering of millions of particles with an interactive frame rate to support knowledge discovery in the complex climate system of the Arctic region."
	},
	{
		"title": "A parallel algorithm for viewshed analysis in three-dimensional Digital Earth",
		"authors": "Feng Wang, Gang Wang, Deji Pan, Yuan Liu, Liuzhong Yang and Hongbo Wang",
		"venue": "Computers & Geosciences",
		"paper_pdf": "assets/papers/viewshedAnalysis.pdf",
		"thumb": "assets/papers/thumb/tVSA.png",
		"year": 2015,
		"short_title": "vsa",
		"doi": "10.1016/j.cageo.2014.10.012",
		"bibtex": "@article{Wang_2016,\n
			doi = {10.3390/cli4030043},\n
			url = {https://doi.org/10.3390%2Fcli4030043},\n
			year = 2016,\n
			month = {sep},\n
			publisher = {{MDPI} {AG}},\n
			volume = {4},\n
			number = {3},\n
			pages = {43},\n
			author = {Feng Wang and Wenwen Li and Sizhe Wang},\n
			title = {Polar Cyclone Identification from 4D Climate Data in a Knowledge-Driven Visualization System},\n
			journal = {Climate},\n}",
			"abstract": "Arctic cyclone activity has a significant association with Arctic warming and Arctic ice decline. Cyclones in the North Pole are more complex and less developed than those in tropical regions. Identifying polar cyclones proves to be a task of greater complexity. To tackle this challenge, a new method which utilizes pressure level data and velocity field is proposed to improve the identification accuracy. In addition, the dynamic, simulative cyclone visualized with a 4D (four-dimensional) wind field further validated the identification result. A knowledge-driven system is eventually constructed for visualizing and analyzing an atmospheric phenomenon (cyclone) in the North Pole. The cyclone is simulated with WebGL on in a web environment using particle tracing. To achieve interactive frame rates, the graphics processing unit (GPU) is used to accelerate the process of particle advection. It is concluded with the experimental results that: (1) the cyclone identification accuracy of the proposed method is 95.6% when compared with the NCEP/NCAR (National Centers for Environmental Prediction/National Center for Atmospheric Research) reanalysis data; (2) the integrated knowledge-driven visualization system allows for streaming and rendering of millions of particles with an interactive frame rate to support knowledge discovery in the complex climate system of the Arctic region."
	}
]

